Enums/упПорядокИсполненияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упПорядокИсполненияЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПутевымЛистом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейсом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упВидыПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упВидыПеревозок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиДобавлятьЗаданияИнкассации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиДобавлятьЗаданияНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПередаватьРейсКПланированию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПередаватьСогласованныеЗаявкиКИсполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыВажности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормированияМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыФормированияМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗоныДляФормированияПредставленияРейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТочкиОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспортныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможноУказаниеРазличныхТочекПогрузкиВЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможноУказаниеРазличныхТочекРазгрузкиВЗаявке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборПеревозчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыВыбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВариантыПодбораТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаРейса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимыйПериодРассогласованностиСФактическимиДанными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПереводЗаявкиКВыполнениюБезРассчитанныхПлановыхДоходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноЗавершениеРейсаПриНаличииНедополученныхДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноНепосредственноеУдалениеОбъектаРейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноОформлениеЗаданияНаПеревозкуБезЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтатистикуПриОпределенииВремениПрохожденияТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяСкладскойУчетНаХабах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяМультимодальныеПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяПравилаПодбораПеревозчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяУслугиИнкассации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоРабочихСмен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьГрафикиРаботыВодителейПриПередачеРейсаКВыполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьПопаданиеВоВременныеОкнаПриПередачеЗаявкиКВыполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСовпадениеЧасовогоПоясаПользователяИДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращатьсяКМаршрутизаторуПриИзмененииМаршрутаКорректировкойРейса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбращатьсяКМаршрутизаторуПриРасчетеРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетРегламентныхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПакетыРегламентныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВводаИнформацииОГрузовыхМестах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПараметрыВводаИнформацииОГрузовыхМестах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПересчитыватьПлановоеВремяПосещенияТочекМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокИсполненияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упПорядокИсполненияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоРежимаТрудаИОтдыхаСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаРежимаТрудаИОтдыхаСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоСвязиТиповГрузовВРейсе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаСвязиТиповГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрисваиватьРейсуПодразделениеТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноДосрочноеУбытиеИзТочкиМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноОтложенноеВыполнениеЧастиРаботПоРейсу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьЗаданияНаПеревозкуПоочередно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеТСПриИсполненииРейса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПрохожденияТочекМаршрута</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыПрохожденияТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРегистрацииЗадолженностиПоДокументамРейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРегистрацииЗадолженностиПоДокументамРейса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаВозвращенныхДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыУчетаВозвращенныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаИнкассируемыхЦенностей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыУчетаИнкассируемыхЦенностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильОтображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаВыбораПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСхемыВыбораПеревозчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаЗапросУсловийПеревозки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОформлениеПутевогоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозкиКонтейнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеноФормированиеКонтейнеров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСозданиеЗаявкиНаПеревозкуКонтейнера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыАдресовДляСтатистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАдреса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПеревозчикиДляТендера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСтатейДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыТочекОтправления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТочкиОтправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыАдресов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриоритетИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/упЗаявкаФормаДокумента/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере форма документа
//
// Параметры:
//  ЭтотОбъект			 - Форма	 - форма заявки.
//  Отказ				 - Булево	 - Истина, в случае ошибки.
//  СтандартнаяОбработка	 - Булево	 - признак стандартной обработки.
//
Процедура ПриСозданииНаСервереФормаДокумента(ЭтотОбъект, Отказ, СтандартнаяОбработка) Экспорт
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Печать
	
	ЭтотОбъект.ИспользуетсяУчетПодразделений     = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетПодразделений"); 
	ЭтотОбъект.ВедетсяРаботаВРазныхЧасовыхПоясах = ПолучитьФункциональнуюОпцию("упВедетсяРаботаВРазныхЧасовыхПоясах"); 
	
КонецПроцедуры

// Процедура - При создании при чтении на сервере инициализация нового объекта форма документа
//
// Параметры:
//  ЭтаФорма	 - Форма							 - форма.
//  Объект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//  Параметры	 - Структура							 - параметры открытия формы.
//
Процедура ПриСозданииПриЧтенииНаСервереИнициализацияНовогоОбъектаФормаДокумента(ЭтаФорма, Объект, Параметры) Экспорт
	
	ЭтаФорма.Статус = Документы.упЗаявкаНаПеревозкуГруза.ПолучитьСтатус(Объект.Ссылка);
	
	ЭтоНовыйОбъект  = Не ЗначениеЗаполнено(Объект.Ссылка);
		
	Если ЭтоНовыйОбъект Тогда
		
		ЭтоКопирование  = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
		
		Объект.Автор                   = ПользователиКлиентСервер.ТекущийПользователь();
		Объект.ИсточникСозданияОбъекта = упСервисныеФункцииКлиентСервер.ИсточникСозданияОбъекта();
		
		Если НЕ ЭтоКопирование Тогда
			
			Если Параметры.Свойство("ПорядокИсполненияЗаявки") Тогда
				Объект.ПорядокИсполненияЗаявки = Параметры.ПорядокИсполненияЗаявки;
			КонецЕсли;
			
			Если Параметры.Свойство("ВидТранспортнойУслуги") Тогда
				Объект.ВидТранспортнойУслуги = Параметры.ВидТранспортнойУслуги;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
				Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
			КонецЕсли;
						
			Если Истина
				И ЗначениеЗаполнено(Объект.ВидПеревозки)
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПеревозки, "ВидТранспортнойУслуги") <> Объект.ВидТранспортнойУслуги 
			Тогда
				Объект.ВидПеревозки = Справочники.упВидыПеревозок.ПустаяСсылка();	
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
				Объект.ВидПеревозки = Справочники.упВидыПеревозок.ЗначениеПоУмолчанию(Объект.ВидПеревозки, Объект.ВидТранспортнойУслуги, Объект.ПорядокИсполненияЗаявки);
			КонецЕсли;
			
			Если Истина
				И ЗначениеЗаполнено(Объект.ВидПеревозки)
				И Объект.ПорядокИсполненияЗаявки = Перечисления.упПорядокИсполненияЗаявок.ПутевымЛистом
			Тогда
				Объект.КоличествоРабочихСмен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПеревозки, "КоличествоРабочихСмен");
			КонецЕсли;

			
		КонецЕсли;
						
		//упУправленияЗаявками.ЗаполнитьПорядокИсполненияЗаявки(Объект);
		
		Если ЭтаФорма.ИспользуетсяУчетПодразделений Тогда
			Объект.Подразделение = Справочники.упСтруктураПредприятия.ПодразделениеПоУмолчанию(Объект.ВидПеревозки, Объект.Автор);
		КонецЕсли;
		
		Если ЭтаФорма.ВедетсяРаботаВРазныхЧасовыхПоясах Тогда
			
			ЧасовойПоясВидаПеревозки	= упСервисныеФункции.ЧасовойПоясВидаПеревозки(Объект.ВидПеревозки);	
			
			// Если при копировании отличаются часовые пояса источника и нового документа.
			Если Истина
				И ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
				И ЗначениеЗаполнено(Объект.ЧасовойПояс)
				И ЗначениеЗаполнено(ЧасовойПоясВидаПеревозки)
				И НЕ Объект.ЧасовойПояс = ЧасовойПоясВидаПеревозки
			Тогда
				Если ЗначениеЗаполнено(Объект.ОтправлениеГрузаС) Тогда
					Объект.ОтправлениеГрузаС		= упСервисныеФункции.ПеревестиВремяПриСменеЧасовогоПояса(Объект.ОтправлениеГрузаС, Объект.ЧасовойПояс, ЧасовойПоясВидаПеревозки); 	
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ОтправлениеГрузаПо) Тогда
					Объект.ОтправлениеГрузаПо	= упСервисныеФункции.ПеревестиВремяПриСменеЧасовогоПояса(Объект.ОтправлениеГрузаПо, Объект.ЧасовойПояс, ЧасовойПоясВидаПеревозки); 
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ПолучениеГрузаС) Тогда
					Объект.ПолучениеГрузаС		= упСервисныеФункции.ПеревестиВремяПриСменеЧасовогоПояса(Объект.ПолучениеГрузаС, Объект.ЧасовойПояс, ЧасовойПоясВидаПеревозки); 
				КонецЕсли;	
				Если ЗначениеЗаполнено(Объект.ПолучениеГрузаПо) Тогда
					Объект.ПолучениеГрузаПо		= упСервисныеФункции.ПеревестиВремяПриСменеЧасовогоПояса(Объект.ПолучениеГрузаПо, Объект.ЧасовойПояс, ЧасовойПоясВидаПеревозки); 
				КонецЕсли;	
			КонецЕсли;	
			Объект.ЧасовойПояс = ЧасовойПоясВидаПеревозки;		
		КонецЕсли;
						
	КонецЕсли;
	
	ЭтаФорма.НастроитьФормуПоВидуПеревозки();
		
КонецПроцедуры

// Процедура - При создании при чтении на сервере инициализация реквизитов формы форма документа
//
// Параметры:
//  ЭтаФорма	 - Форма							 - форма.
//  Объект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//  Параметры	 - Структура							 - параметры открытия формы.
//
Процедура ПриСозданииПриЧтенииНаСервереИнициализацияРеквизитовФормыФормаДокумента(ЭтаФорма, Объект, Параметры) Экспорт
		
	ЭтаФорма.ЗаблокироватьЭлементы();
	
	// Валютный учет
	ЭтаФорма.ВедетсяВалютныйУчет = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	Если ЭтаФорма.ВедетсяВалютныйУчет Тогда
		ЭтаФорма.ВалютаРеглУчета = упСервисныеФункцииВызовСервера.ВалютаРегламентированногоУчетаОбъекта(Объект);
		ЭтаФорма.ВалютаУпрУчета  = упСервисныеФункцииВызовСервера.ВалютаУправленческогоУчета();
		Объект.Валюта            = ЭтаФорма.ВалютаУпрУчета;
	КонецЕсли;
	
	Взаимодействия.ПодготовитьОповещения(ЭтаФорма, Параметры, Ложь);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Взаиморасчеты
	ЭтаФорма.РазрешеноЗагружатьВзаиморасчеты = ПолучитьФункциональнуюОпцию("упЗагружатьВзаиморасчетыСПартнерами");
	ЭтаФорма.ВзаиморасчетыЗагружаются        = Ложь;
	ЭтаФорма.ВзаиморасчетыЗагрузить          = Ложь;
	ЭтаФорма.Элементы.ГруппаСостояниеВзаиморасчетов.Видимость = ЭтаФорма.РазрешеноЗагружатьВзаиморасчеты;
	
	УказываютсяФактическиОказанныеУслуги = ПолучитьФункциональнуюОпцию("упУказываютсяФактическиОказанныеУслуги");
	
	ЭтаФорма.Элементы.ГруппаПлановыеДоходы.Видимость = УказываютсяФактическиОказанныеУслуги;
	ЭтаФорма.Элементы.ГруппаСумма.Видимость = УказываютсяФактическиОказанныеУслуги;
	
	// Основание.
	Если ЗначениеЗаполнено(Объект.ДокументОснование)Тогда
		ЭтаФорма.Элементы.ДокументОснования.Видимость = Истина;
		ЭтаФорма.Элементы.ДокументОснования.ТолькоПросмотр = Истина;
	Иначе
		ЭтаФорма.Элементы.ДокументОснования.Видимость = Ложь;
	КонецЕсли;
		
	упРейс.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

// Процедура - Обработка проверки заполнения на сервере форма документа
//
// Параметры:
//  ЭтаФорма	 - Форма							 - форма.
//  Объект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//  Отказ				 - Булево	 - Истина, в случае ошибки.
//  ПроверяемыеРеквизиты	 - Массив	 - проверяемые реквизиты.
//
Процедура ОбработкаПроверкиЗаполненияНаСервереФормаДокумента(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	упЗаданиеНаПеревозку.ПроконтролироватьИнтервалОтправкиПолучения(Объект.ОтправлениеГрузаС, Объект.ОтправлениеГрузаПо, Объект.ПолучениеГрузаС, Объект.ПолучениеГрузаПо, Отказ);	
	
КонецПроцедуры

// Процедура - Перед записью на сервере форма документа
//
// Параметры:
//  ЭтаФорма		 - Форма							 - форма.
//  Отказ			 - Булево							 - Истина, в случае ошибки.
//  ТекущийОбъект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//  ПараметрыЗаписи	 - Структура							 - параметры записи.
//
Процедура ПередЗаписьюНаСервереФормаДокумента(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ЗначениеЗаполнено(ЭтаФорма.НовыйСтатус) Тогда 
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Статус", ЭтаФорма.НовыйСтатус);
	КонецЕсли;	
	
	ЭтаФорма.НовыйСтатус = Неопределено;
		
КонецПроцедуры

// Процедура - После записи на сервере форма документа
//
// Параметры:
//  ЭтаФорма		 - Форма							 - форма.
//  Отказ			 - Булево							 - Истина, в случае ошибки.
//  ТекущийОбъект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//  ПараметрыЗаписи	 - Структура							 - параметры записи.
//
Процедура ПослеЗаписиНаСервереФормаДокумента(ЭтаФорма, Объект, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ЭтаФорма.Статус = Документы.упЗаявкаНаПеревозкуГруза.ПолучитьСтатус(Объект.Ссылка);
	ЭтаФорма.ЗаблокироватьЭлементы();
	
	Если ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		сткРеквизиты = упСервисныеФункцииВызовСервера.ЗначенияРеквизитовОбъекта(Объект.ВидПеревозки, "ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза, ИспользуютсяМультимодальныеПеревозки, ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки");
		ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза                     = сткРеквизиты.ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза;
		ИспользуютсяМультимодальныеПеревозки                            = сткРеквизиты.ИспользуютсяМультимодальныеПеревозки;
		ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки = сткРеквизиты.ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки;
	Иначе
		ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза = Ложь;
		ИспользуютсяМультимодальныеПеревозки = Ложь;
		ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки = Ложь;
	КонецЕсли;
	
	упРаботаСоСтатусами.УстановитьКнопкиСтатусаЗаявкиНаПеревозкуГруза(Объект.Ссылка, ЭтаФорма.Статус, ЭтаФорма.Элементы, ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза, (ИспользуютсяМультимодальныеПеревозки И ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки));
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	упРейс.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Вид перевозки при изменении на сервере
//
// Параметры:
//  ЭтаФорма	 - Форма							 - форма.
//  Объект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//
Процедура ВидПеревозкиПриИзмененииНаСервере(ЭтаФорма, Объект) Экспорт
	
	ЭтаФорма.НастроитьФормуПоВидуПеревозки();
	
	Если ЭтаФорма.ИспользуетсяУчетПодразделений Тогда
		Подразделение = Справочники.упСтруктураПредприятия.ПодразделениеПоУмолчанию(Объект.ВидПеревозки);
		Если Истина
			И ЗначениеЗаполнено(Подразделение)
			И НЕ Подразделение = Объект.Подразделение 
		Тогда
			Объект.Подразделение = Подразделение;
		КонецЕсли;
	КонецЕсли; 
	
	Если ЭтаФорма.ВедетсяРаботаВРазныхЧасовыхПоясах Тогда
		ЧасовойПоясВидаПеревозки	= упСервисныеФункции.ЧасовойПоясВидаПеревозки(Объект.ВидПеревозки);	
		Если ЧасовойПоясВидаПеревозки <> Объект.ЧасовойПояс Тогда
			Объект.ЧасовойПояс = ЧасовойПоясВидаПеревозки;
		КонецЕсли;
	КонецЕсли;
	
	упУправленияЗаявками.ЗаполнитьПорядокИсполненияЗаявки(Объект);
	
КонецПроцедуры

// Процедура - Заполнить типовыми статьями доходов на сервере
//
// Параметры:
//  ЭтаФорма	 - Форма							 - форма.
//  Объект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//
Процедура ЗаполнитьТиповымиСтатьямиДоходовНаСервере(ЭтаФорма, Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	                  |	тбВидыПеревозокСписокТиповыхСтатейДоходов.СтатьяДоходов КАК СтатьяДоходов,
	                  |	1 КАК Количество
	                  |ПОМЕСТИТЬ втСтатьиДоходов
	                  |ИЗ
	                  |	Справочник.упВидыПеревозок.СписокСтатейДоходов КАК тбВидыПеревозокСписокТиповыхСтатейДоходов
	                  |ГДЕ
	                  |	тбВидыПеревозокСписокТиповыхСтатейДоходов.Ссылка = &ВидПеревозки
	                  |	И НЕ тбВидыПеревозокСписокТиповыхСтатейДоходов.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.упСтатьиДоходовРасходов.ПустаяСсылка)
	                  |
	                  |ОБЪЕДИНИТЬ
	                  |
	                  |ВЫБРАТЬ
	                  |	упСоглашенияСКлиентамиСтатьиДоходов.СтатьяДоходов,
	                  |	1
	                  |ИЗ
	                  |	Справочник.упСоглашенияСКлиентами.СтатьиДоходов КАК упСоглашенияСКлиентамиСтатьиДоходов
	                  |ГДЕ
	                  |	упСоглашенияСКлиентамиСтатьиДоходов.Ссылка = &Соглашение
	                  |	И НЕ упСоглашенияСКлиентамиСтатьиДоходов.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.упСтатьиДоходовРасходов.ПустаяСсылка)
	                  |
	                  |ОБЪЕДИНИТЬ ВСЕ
	                  |
	                  |ВЫБРАТЬ
	                  |	упЗаявкаНаПеревозкуГрузаДополнительныеОперации.ДополнительнаяОперация.СтатьяДоходов,
	                  |	упЗаявкаНаПеревозкуГрузаДополнительныеОперации.Количество
	                  |ИЗ
	                  |	Документ.упЗаявкаНаПеревозкуГруза.ДополнительныеОперации КАК упЗаявкаНаПеревозкуГрузаДополнительныеОперации
	                  |ГДЕ
	                  |	упЗаявкаНаПеревозкуГрузаДополнительныеОперации.Ссылка = &Ссылка
	                  |	И НЕ упЗаявкаНаПеревозкуГрузаДополнительныеОперации.ДополнительнаяОперация.СтатьяДоходов = ЗНАЧЕНИЕ(Справочник.упСтатьиДоходовРасходов.ПустаяСсылка)
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	втСтатьиДоходов.СтатьяДоходов,
	                  |	СУММА(втСтатьиДоходов.Количество) КАК Количество,
	                  |	упСтатьиДоходовРасходов.СтавкаНДС
	                  |ИЗ
	                  |	втСтатьиДоходов КАК втСтатьиДоходов
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упСтатьиДоходовРасходов КАК упСтатьиДоходовРасходов
	                  |		ПО втСтатьиДоходов.СтатьяДоходов = упСтатьиДоходовРасходов.Ссылка
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	втСтатьиДоходов.СтатьяДоходов,
	                  |	упСтатьиДоходовРасходов.СтавкаНДС";
	Запрос.УстановитьПараметр("ВидПеревозки", Объект.ВидПеревозки);
	Запрос.УстановитьПараметр("Соглашение",   Объект.Соглашение);
	Запрос.УстановитьПараметр("Ссылка",       Объект.Ссылка);
	
	Объект.ПлановыеДоходы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Функция - Изменить статус заявки
//
// Параметры:
//  ЭтаФорма		 - Форма									 - форма.
//  Объект		 - ДокументОбъект.упЗаявкаНаПеревозкуГруза		 - объект заявки.
//  СтатусЗаявки	 - ПеречислениеСсылка.упСтатусыЗаявкиНаПеревозкуГруза	 - статус заявки
// 
// Возвращаемое значение:
//  Булево - Истина, если успешно.
//
Функция ИзменитьСтатусЗаявки(ЭтаФорма, Объект, СтатусЗаявки) Экспорт
	
	ЭтаФорма.НовыйСтатус = СтатусЗаявки;
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Попытка
			ЭтаФорма.Записать();		
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ЗаписьЖурналаРегистрации("Ошибка при проведении заявки на перевозку груза", УровеньЖурналаРегистрации.Ошибка, ,Объект.Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
        	Возврат Ложь;    
		КонецПопытки;
	
		Возврат Истина;
		
	КонецЕсли;
	
	ЭтаФорма.НовыйСтатус = Неопределено;
	
	Возврат Ложь;
	
КонецФункции

// Процедура - Изменился статус
//
// Параметры:
//  ЭтаФорма	 - Форма							 - форма.
//  Объект	 - ДокументОбъект.упЗаявкаНаПеревозкуГруза	 - объект заявки.
//
Процедура ИзменилсяСтатус(ЭтаФорма, Объект) Экспорт
	
	ЭтаФорма.Статус = Документы.упЗаявкаНаПеревозкуГруза.ПолучитьСтатус(Объект.Ссылка);
	ЭтаФорма.ЗаблокироватьЭлементы();
	
	сткРеквизиты = упСервисныеФункцииВызовСервера.ЗначенияРеквизитовОбъекта(Объект.ВидПеревозки, "ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза, ИспользуютсяМультимодальныеПеревозки, ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки");
	упРаботаСоСтатусами.УстановитьКнопкиСтатусаЗаявкиНаПеревозкуГруза(Объект.Ссылка, ЭтаФорма.Статус, ЭтаФорма.Элементы,
			сткРеквизиты.ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза,
			(сткРеквизиты.ИспользуютсяМультимодальныеПеревозки И сткРеквизиты.ВозможнаКорректировкаПоследовательностиМультимодальнойПеревозки));			
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
